#include    "app.h"

const   uint32_t    WIDTH = 1024;
const   uint32_t    HEIGHT = 768;

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
HelloTriangleApplication::HelloTriangleApplication()
    : window(nullptr)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
HelloTriangleApplication::~HelloTriangleApplication()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void HelloTriangleApplication::run()
{
    initWindow();

    initVulkan();

    mainLoop();

    cleanup();
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void HelloTriangleApplication::initWindow()
{
    // Инициализируем GLFW
    glfwInit();

    // Указываем GLFW что НЕ НАДО создавать контекст OpenGL
    glfwWindowHint(GLFW_CLIENT_API, GLFW_NO_API);

    // Отключаем изменяемый размер окна (рано еще, маленькие еще!)
    glfwWindowHint(GLFW_RESIZABLE, GLFW_FALSE);

    // Создаем окно
    window = glfwCreateWindow(WIDTH, HEIGHT, "Vulkan", nullptr, nullptr);
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void HelloTriangleApplication::initVulkan()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void HelloTriangleApplication::mainLoop()
{
    // Цикл обработки сообщений окна
    while (!glfwWindowShouldClose(window))
    {
        glfwPollEvents();
    }
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void HelloTriangleApplication::cleanup()
{
    glfwDestroyWindow(window);

    glfwTerminate();
}
